/*Задача 4: Напишите программу, 
которая принимает на вход три числа и выдаёт максимальное из этих чисел.
Например:
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22*/
Console.Clear();
Console.Write("Введите 1-ое число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите 2-ое число: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите 3-е число: ");
int с = Convert.ToInt32(Console.ReadLine());
int i = max;
if (max < b)
{
    Console.WriteLine(max=b);
}
if (max < c)
{
    Console.WriteLine(max=c);
}

